---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryZRotationFixed
source: html/ed4875b8-a9bf-2b3a-f888-96e1c93db136.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryZRotationFixed Property

"Z Rotation - Fixed"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryZRotationFixed { get; }
```